import 'package:flutter/material.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';
import 'package:tawbatona/core/theme/colors/app_colors.dart';
import 'package:tawbatona/core/utils/text_styles/text_styles.dart';

class AthkarScreen extends StatelessWidget {
  const AthkarScreen({super.key});

  @override
  Widget build(BuildContext context) {
    return Padding(
      padding: EdgeInsets.symmetric(horizontal: 10.w, vertical: 15.h),
      child: Directionality(
        textDirection: TextDirection.rtl,
        child: SingleChildScrollView(
          child: RichText(
            text: TextSpan(
              text: "أذكار الصباح والمساء: \n",
              style: TextStyles.font17BlackBoldGilroy().copyWith(
                color: AppColors.primaryColor,
              ),
              children: [
                TextSpan(
                  text:
                      """اللهم أنت ربي، لا إله إلا أنت، خلَقتني وأنا عبدك، وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شرِّ ما صنعت، أبُوء لك بنعمتك عليّ وأبوء بذنبي، فاغفر لي؛ فإنه لا يغفر الذنوب إلا أنت"، قال: "مَن قالها من النهار موقنًا بها، فمات من يومه قبل أن يُمسي، فهو من أهل الجنة، ومن قالها من الليل وهو مُوقن بها، فمات قبل أن يُصبح، فهو من أهل الجنة.""",
                  style: TextStyles.font14BlackMediumGilroy().copyWith(
                    fontSize: 17.sp,
                  ),
                ),
                subTitle("""\n\n إذا أصبح أحدكم فليقل:"""),
                normalText(
                    """ اللهم بك أصبحنا، وبك أمسينا، وبك نحيا، وبك نموت، وإليك النشور."""),
                subTitle("""\n\n وإذا أمسى فليقل:"""),
                normalText(
                    """ اللهم بك أمسينا، وبك أصبَحنا، وبك نحيا، وبك نموت، وإليك المصير."""),
                normalText(
                    """\n\n أصبحنا (أمسينا) على فِطرة الإسلام، وكلمة الإخلاص، ودين نبينا محمد -صلى الله عليه وسلم- ومِلة أبينا إبراهيم حنيفًا مسلمًا وما كان من المشركين."""),
                normalText(
                    "\n\n اللهم إني أسألك العافية في الدنيا والآخرة، اللهم إني أسألك العفو والعافية في ديني ودنياي، وأهلي ومالي، اللهم استُر عوراتي، وآمِن رَوعاتي، اللهم احفظني من بين يدي ومن خلفي، وعن يميني وعن شمالي، ومن فوقي، وأعوذ بعظمتك أن أُغتال من تحتي."),
                normalText(
                    """\n\n "اللهم عافني في بدني، اللهم عافني في سمعي، اللهم عافني في بصري، لا إله إلا أنت"، ثلاث مرات."""),
                normalText(
                    """\n\n "اللهم إني أعوذ بك من الكفر والفقر، اللهم إني أعوذ بك من عذاب القبر، لا إله إلا أنت"، ثلاث مرات."""),
                normalText(
                    """\n\n أصبحنا وأصبح (أمسينا وأمسى) المُلك لله، والحمد لله، لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير، ربِّ أسألك خير ما في هذا اليوم (الليلة)، وخير ما بعده، وأعوذ بك من شرِّ ما في هذا اليوم (الليلة)، وشر ما بعده، ربِّ أعوذ بك من الكسل، وسوء الكِبَر، ربِّ أعوذ بك من عذابٍ في النار وعذاب في القبر."""),
                normalText(
                    """\n\n اللهم فاطر السموات والأرض، عالم الغيب والشهادة، ربَّ كلِّ شيء ومليكه، أشهد أنْ لا إله إلا أنت، أعوذ بك من شرِّ نفسي، وشر الشيطان وشِرْكه، وأن أَقترف على نفسي سوءًا، أو أجرَّه إلى مسلم."""),
                normalText(
                    """\n\n "رضيت بالله ربًّا، وبالإسلام دينًا، وبمحمد -صلى الله عليه وسلم- نبيًّا"، "من قالها حين يُصبح وحين يمسي، كان حقًّا على الله أن يُرضيه"."""),
                normalText(
                    """\n\n يا حي يا قيُّوم، برحمتك أستغيث، أصلِح لي شأني كله، ولا تَكلني إلى نفسي طرْفة عينٍ."""),
                normalText(
                    """\n\n "لا إله إلا الله وحده لا شريك له، له الملك وله الحمد، وهو على كل شيء قدير"، مائة مرة."""),
                normalText(
                    """\n\n "سبحان الله وبحمده عدد خلقه، ورضا نفسه، وزِنة عرشه، ومداد كلماته"، ثلاث مرات."""),
                subTitle(
                    """\n\n ﴿ اللَّهُ لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ وَلَا يَئُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيم ﴾"""),
                normalText(
                    """\n\n "سورة الإخلاص، والفلق، والناس"، ثلاث مرات."""),
                normalText(
                    """\n\n "بسم الله الذي لا يضرُّ مع اسمه شيء في الأرض ولا في السماء وهو السميع العليم"، ثلاث مرات."""),
                normalText(
                    """\n\n "اللهم إني أصبحت (أمسيتُ) أُشهدك وأُشهد حمَلة عرشك وملائكتك، وجميع خلْقك أنَّك أنت الله، لا إله إلا أنت وأن محمدًا عبدك ورسولك"، أربع مرات."""),
                normalText(
                    """\n\n اللهم إني أسألك علمًا نافعًا ورزقًا طيبًا وعملاً متقبَّلاً."""),
                normalText("""\n\n "سبحان الله وبحمده"، مائة مرة."""),
                normalText("""\n\n "أستغفر الله"، مائة مرة"""),
                normalText(
                    """\n\n اللهم اجعل في قلبي نورًا، وفي لساني نورًا، واجعل في سمعي نورًا، واجعل في بصري نورًا، واجعل من خلفي نورًا، ومن أمامي نورًا، واجعل من فوقي نورًا، ومن تحتي نورًا، اللهم أعطني نورًا"""),
                normalText(
                    """\n\n "من قال: سبحان الله مائة مرة قبل طلوع الشمس وقبل غروبها، كان أفضل من مائة بدَنة، ومن قال: الحمد لله مائة مرة قبل طلوع الشمس وقبل غروبها، كان أفضل من مائة فرس يحمل عليها في سبيل الله، ومَن قال: الله أكبر مائة مرة قبل طلوع الشمس وقبل غروبها، كان أفضل من عتْق مائة رَقبة، ومن قال: لا إله إلا الله وحده لا شريك له ، له الملك وله الحمد وهو على كل شيء قديرٌ مائة مرة قبل طلوع الشمس وقبل غروبها - لم يَجئ يوم القيامة أحد بعمل أفضلَ من عمله، إلا من قال مثل قوله، أو زادَ عليه"."""),
                title("""\n\n\n باب ما يقول إذا استيقَظ من منامه:"""),
                normalText(
                    """\n الحمد لله الذي أحيانًا بعد ما أماتنا وإليه النشور."""),
                normalText(
                    """\n\n الحمد لله الذي ردَّ علي رُوحي، وعافاني في جسدي، وأَذِن لي بذِكره."""),
                title("""\n\n\n باب ما يقول إذا لبِس ثوبه:"""),
                normalText(
                    """\n اللهم إني أسألك من خيره وخير ما هو له، وأعوذ بك من شره وشرِّ ما هو له."""),
                title("""\n\n\n باب الذكر قبل الوضوء:"""),
                normalText(
                    """\n أشهد أنْ لا إله إلا الله وحده لا شريك له، وأشهد أن محمدًا عبده ورسوله"، من قالها، فُتِحت له أبواب الجنة الثمانية، يدخل من أيِّها شاء."""),
                normalText(
                    """\n\n "سبحانك اللهم وبحمْدك، أشهد أنْ لا إله إلا أنت، أستغفرك اللهم وأتوب إليك"، من توضَّأ فأسبَغ الوضوء، ثم قالها عند فراغه من وضوئه- خُتِم عليها بخاتم، فوُضِعت تحت العرش، فلم يُكسَر إلى يوم القيامة."""),
                title("""\n\n\n باب ما يقال عند الخروج من المنزل:"""),
                normalText(
                    """\n بسم الله، توكَّلت على الله، ولا حول ولا قوة إلا بالله."""),
                normalText(
                    """\n\n اللهم إني أعوذ بك أن أَضِلَّ، أو أُضَل، أو أَزِل، أو أُزَل، أو أَظْلِم، أو أُظْلَم، أو أجْهَل، أو يُجهل علي"""),
                title("""\n\n\n باب ما يقال عند الدخول إلى المنزل:"""),
                normalText(
                    """\n بسم الله وَلَجنا، وبسم الله خرجنا، وعلى الله ربنا توكَّلنا، ثم ليسلِّم على أهله"""),
                title("""\n\n\n باب ما يقول بعد تكبيرة الإحرام:"""),
                normalText(
                    """\n وجهت وجهي للذي فطر السموات والأرض حنيفًا وما أنا من المشركين، إن صلاتي ونسكي ومحياي ومماتي لله رب العالمين، لا شريك له وبذلك أُمرت وأنا من المسلمين، اللهم أنت الملك، لا إله إلا أنت، أنت ربي وأنا عبدك، ظلَمت نفسي، واعترَفت بذنبي، فاغفر لي ذنوبي جميعًا؛ إنه لا يغفر الذنوب إلا أنت، واهدني لأحْسن الأخلاق، لا يهدي لأحسنها إلا أنت، واصرِف عني سيِّئها، لا يصرف عني سيِّئها إلا أنت، لبَّيك وسَعديك، والخير كله في يديك، والشر ليس إليك، أنا بك وإليك، تبارَكت وتعالَيت، أستغفرك وأتوب إليك."""),
                normalText(
                    """\n\n سبحانك اللهم وبحمدك، وتبارَك اسْمك وتعالَى جدُّك، ولا إله غيرك"""),
                normalText(
                    """\n\n اللهم باعِد بيني وبين خطاياي كما باعَدت بين المشرق والمغرب، اللهم نقِّني من خطاياي كما يُنقَّى الثوب الأبيض من الدَّنس، اللهم اغسلني من خطاياي بالثلج والماء والبرد."""),
                normalText("""\n\n الحمد لله حمدًا كثيرًا طيبًا مباركًا فيه"""),
                normalText(
                    """\n\n الله أكبر كبيرًا، والحمد لله كثيرًا، وسبحان الله بكرة وأصيلاً."""),
                title("""\n\n\n باب التعوُّذ بعد دعاء الاستفتاح:"""),
                normalText(
                    """\n أعوذ بالله من الشيطان الرجيم؛ من همْزه، ونفْخه ونفْثه."""),
                title("""\n\n\n باب الدعاء إذا فرغ من التشهُّد:"""),
                normalText(
                    """\n اللهم إني أعوذ بك من عذاب جهنَّم ومن عذاب القبر، ومن فتنة المحيا والممات، ومن شرِّ فتنة المسيح الدجَّال."""),
                title("""\n\n\n وكان من آخر ما يقول بين التشهُّد والتسليم:"""),
                normalText(
                    """\n اللهم اغفر ما قدَّمت وما أخَّرت، وما أسرَرت وما أعْلَنت، وما أسرَفت، وما أنت أعلم به مني، أنت المقدِّم وأنت المؤخِّر، لا إله إلا أنت"""),
                title("""\n\n\n باب دعاء السفر:"""),
                normalText("""\n الله أكبر، الله أكبر، الله أكبر،"""),
                subTitle(
                    """ ﴿ سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ * وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ ﴾"""),
                normalText(
                    """\n\n اللهمَّ إنَّا نسألك في سفرنا هذا البر والتقوى، ومن العمل ما ترضى، اللهم هوِّن علينا سفرنا هذا، واطْوِ عنَّا بُعده، اللهم أنت الصاحب في السفر، والخليفة في الأهل، اللهم إني أعوذ بك من وعثاء السفر، وكآبة المنظر، وسوء المُنقلَب في المال والأهل"""),
                subTitle(""" ، وإذا رجع قالهنَّ وزاد فيهنَّ:"""),
                normalText(""" آيبون، تائبون، عابدون، لربنا حامدون."""),
                title("""\n\n\n باب ما يقول مَن أحسَّ وجعًا في جسده:"""),
                subTitle("""\n ضَعْ يدك على الذي تألَّم من جسدك وقل: """),
                normalText(
                    """بسم الله: ثلاثًا، وقل سبع مرات: أعوذ بالله وقدرته من شرِّ ما أجد وأُحاذر."""),
                title("""\n\n\n دعاء قضاء الدَّين:"""),
                normalText(
                    """\n اللهم اكفِني بحلالك عن حرامك، وأغنني بفضلك عمَّن سواك."""),
                title("""\n\n\n باب دعاء الهم والحزن:"""),
                normalText(
                    """\n اللهم إني عبدك، ابن عبدك، ابن أَمَتك، ناصيتي بيدك، ماضٍ فيّ حُكمك، عدْلٌ فيّ قضاؤك، أسألك بكل اسم هو لك، سمَّيت به نفسك، أو أنزَلته في كتابك، أو علَّمته أحدًا من خلقك، أو استأثَرت به في علم الغيب عندك، أن تجعل القرآن ربيع قلبي، ونور صدري، وجلاء حزني، وذَهاب همِّي."""),
                normalText(
                    """\n\n اللهم إني أعوذ بك من الهم والحزن، والعجز والكسل، والبخل والجُبن، وضَلَع الدَّين وغلَبة الرجال."""),
                title("""\n\n\n باب دعاء الكَرب:"""),
                normalText(
                    """\n لا إله إلا الله العظيم الحليم، لا إله إلا الله رب العرش العظيم، لا إله إلا الله رب السماوات ورب الأرض ورب العرش الكريم."""),
              ],
            ),
          ),
        ),
      ),
    );
  }
}

TextSpan title(String title) => TextSpan(
      text: title,
      style: TextStyles.font17BlackBoldGilroy().copyWith(
        color: AppColors.primaryColor,
      ),
    );

TextSpan subTitle(String text) => TextSpan(
      text: text,
      style: TextStyles.font14BlackMediumGilroy().copyWith(
        fontSize: 18.sp,
        fontWeight: FontWeight.bold,
      ),
    );

TextSpan normalText(String text) => TextSpan(
      text: text,
      style: TextStyles.font14BlackMediumGilroy().copyWith(
        fontSize: 17.sp,
      ),
    );
